#define _CRT_SECURE_NO_WARNINGS 1
#include <stdio.h>
#include <string.h>
#include <stdlib.h>
#include <stdbool.h>
#include <math.h>
// 标识符:
// C++规定给标识符(变量,常量,结构体,函数,类  等大多数需要自己创建的名称 )命名时,必须遵循以下规则
// 
// (1) 在名称中,只能使用字母字符,数字和下划线,
// (2) 名称的第一个字符不能是数字,只能是字母字符或者下划线    (为了方便记忆,只需记得_下划线可以做为标识符第一个字符)
// (3) 名称区分大写字符和小写字符               注意:        C++是严格区分大小写的,不仅标识符这里是这样,其他所有地方都这样
// (4) 不能将C++关键字用作名称
//		关键字又叫保留字,是C++预先保留的标识符
//		意思是C++把一些名字征用了,有特别的用途,没有征用的名字,可以随便用
// (5)以下划线和大写字母打头的名称最好别用,虽然是合法的,但是编译器可能会使用它,导致不确定性
// 	以下划线和大写字母打头的名称被保留给编译器及其使用的资源使用，如果违反了这一规则，会导致行为的不确定性。
// (6) C++对名称的长度没有限制，但有些平台可能有长度限制（但是不会小于64字符）。
// 
// 
// 
// 
// 
// 
// 
// 
// 
// 
// 
// 
//
#include <iostream>
using namespace std;

int main()
{
	//int a4_~;
	//int _a4;
	//int a_4;
	//int 4_a;
	//int aa;
	//AA = 1;
	//int aa;
	//aa = 1;
	//int return;
	return 0;
}